const expect = require('chai').expect
const hotPotato = require('../src/9-queue-hot-patato')

describe('hotPotato Test', () => {
  it('击鼓传花游戏测试', () => {
    let names = ['张三', '李四', '王五', '赵六', '陈七']
    let { eliminateList, winner } = hotPotato(names, 7)
    let expectList = ['王五', '李四', '陈七', '赵六']
    expect(eliminateList).to.deep.equal(expectList)
    expect(winner).to.equal('张三')
  })
})

// 0 '李四' '王五' '赵六' '陈七' '张三'
// 1 '王五' '赵六' '陈七' '张三' '李四'
// 2 '赵六' '陈七' '张三' '李四' '王五'
// 3 '陈七' '张三' '李四' '王五' '赵六'
// 4 '张三' '李四' '王五' '赵六' '陈七'
// 5 '李四' '王五' '赵六' '陈七' '张三'
// 6 '王五' '赵六' '陈七' '张三' '李四'
// 淘汰 '王五'
// 0 '陈七' '张三' '李四' '赵六'
// 1 '张三' '李四' '赵六' '陈七'
// 2 '李四' '赵六' '陈七' '张三'
// 3 '赵六' '陈七' '张三' '李四'
// 4 '陈七' '张三' '李四' '赵六'
// 5 '张三' '李四' '赵六' '陈七'
// 6 '李四' '赵六' '陈七' '张三'
// 淘汰 '李四'
// 0 '陈七' '张三' '赵六'
// 1 '张三' '赵六' '陈七'
// 2 '赵六' '陈七' '张三'
// 3 '陈七' '张三' '赵六'
// 4 '张三' '赵六' '陈七'
// 5 '赵六' '陈七' '张三'
// 6 '陈七' '张三' '赵六'
// 淘汰 '陈七'
// 0 '赵六' '张三'
// 1 '张三' '赵六'
// 2 '赵六' '张三'
// 3 '张三' '赵六'
// 4 '赵六' '张三'
// 5 '张三' '赵六'
// 6 '赵六' '张三'
// 淘汰 '赵六'
// winner '张三'
